In [1]:
import numpy as np
import pandas as pd

# 1)Pandas Series

Creating series through List

In [2]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

Creating series through numpy array

In [3]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

Passing the index to the data

In [4]:
pd.Series(index=['Rohit','Virat','Bumrah','Pant','Kuldeep'],data=[45,18,99,21,33])

Rohit      45
Virat      18
Bumrah     99
Pant       21
Kuldeep    33
dtype: int64

Creating Series through Dictionary

In [5]:
marks={'Maths':90,'Science':85,'Marathi':95,'History':80}
pd.Series(marks)

Maths      90
Science    85
Marathi    95
History    80
dtype: int64

Repeat the series using repeat function

In [6]:
pd.Series({'Rohit':45}).repeat(5)

Rohit    45
Rohit    45
Rohit    45
Rohit    45
Rohit    45
dtype: int64

In [7]:
s = pd.Series([45,18]).repeat([5,5]).reset_index(drop = True)
s

0    45
1    45
2    45
3    45
4    45
5    18
6    18
7    18
8    18
9    18
dtype: int64

Accessing the element from Series

In [8]:
s[4],s[6]

(45, 18)

In [9]:
s[2:-2]

2    45
3    45
4    45
5    18
6    18
7    18
dtype: int64

# 2)Aggregate Function on Pandas Series

Pandas Series.aggregate() function aggregate using one or more operations over the specified axis in the given series object.

In [10]:
s=pd.Series([11,22,33,44,55,66,77])
s.agg([min,max,sum])

min     11
max     77
sum    308
dtype: int64

# 3)Absolute Function on Series


Pandas Series.abs() method is used to get the absolute numeric value of each element in Series/DataFrame.

In [11]:
t=pd.Series([1,-2,-3,4,-5,-6])
t.abs()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

# 4)Appending one Series to another Series

Pandas Series.append() function is used to concatenate two or more series object.

In [12]:
s=pd.Series([-1,-2,-3])
t=pd.Series([1,2,3])
u=s.append(t)

C:\Users\New\AppData\Local\Temp\ipykernel_15376\2724458096.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  u=s.append(t)

In [13]:
print(u)

0   -1
1   -2
2   -3
0    1
1    2
2    3
dtype: int64

In [14]:
u.reset_index(drop=True)

0   -1
1   -2
2   -3
3    1
4    2
5    3
dtype: int64

# 5)Astype Function

Pandas astype() is the one of the most important methods. It is used to change data type of a series.

In [15]:
s

0   -1
1   -2
2   -3
dtype: int64

In [16]:
type(s[2])

numpy.int64

In [17]:
s.astype('float')

0   -1.0
1   -2.0
2   -3.0
dtype: float64

# 6)All String function can be used to extract or modify texts in a series

Upper and Lower Function
 
 Len function
 
 Strip Function
 
 Split Function
 
 Contains Function
 
 Replace Function
 
 Count Function
 
 Startswith and Endswith Function
 
 Find Finction

In [18]:
txt=pd.Series(['Data Science','Machine Learning','Data Analysis','Python Programming','NLP','Deep Learning'])

Upper and Lower Function

In [19]:
print(txt.str.upper())
print('*'*40)
print(txt.str.lower())

0          DATA SCIENCE
1      MACHINE LEARNING
2         DATA ANALYSIS
3    PYTHON PROGRAMMING
4                   NLP
5         DEEP LEARNING
dtype: object
****************************************
0          data science
1      machine learning
2         data analysis
3    python programming
4                   nlp
5         deep learning
dtype: object

Length Function

In [20]:
for i in txt:
    print(len(i))

12
16
13
18
3
13

Strip Function

In [21]:
txt=pd.Series(['Data Scicence','Machine Learning','Data Analysis','Python Programming','NLP','Deep Learning'])

for i in txt:
    print(i ,len(i))

Data Scicence 13
Machine Learning 16
Data Analysis 13
Python Programming 18
NLP 3
Deep Learning 13

Contain Function

In [22]:
txt=pd.Series(['Data@Scicence','Machine@Learning','Data Analysis','Python Programming','NLP','Deep@Learning'])
txt.str.contains('@')

0     True
1     True
2    False
3    False
4    False
5     True
dtype: bool

Replace fucntion

In [23]:
txt.str.replace('@','#')

0         Data#Scicence
1      Machine#Learning
2         Data Analysis
3    Python Programming
4                   NLP
5         Deep#Learning
dtype: object

Count Function

In [24]:
txt.str.count('e')

0    2
1    2
2    0
3    0
4    0
5    3
dtype: int64

Startwith and Endswith Function

In [25]:
txt.str.startswith('D')

0     True
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [26]:
txt.str.endswith('g')

0    False
1     True
2    False
3     True
4    False
5     True
dtype: bool

Find Function

In [27]:
txt.str.find('Data')

0    0
1   -1
2    0
3   -1
4   -1
5   -1
dtype: int64

# 7)Concerting Series to List

In [28]:
txt.to_list()

['Data@Scicence',
 'Machine@Learning',
 'Data Analysis',
 'Python Programming',
 'NLP',
 'Deep@Learning']

# 8)Creating DataFrames

creating DataFrame using list

In [29]:
lst=['Data@Scicence','Machine@Learning','Data Analysis','Python Programming','NLP','Deep@Learning']
pd.DataFrame(lst)

                    0
0       Data@Scicence
1    Machine@Learning
2       Data Analysis
3  Python Programming
4                 NLP
5       Deep@Learning

In [30]:
lst1=[[1,'Sachin'],[2,'Rohit'],[3,'Virat']]
pd.DataFrame(lst1)

   0       1
0  1  Sachin
1  2   Rohit
2  3   Virat

Creating DataFrame from dict ndarray/list

In [31]:
data={'Name':['Sachin','Rohit','Virat'],'JNO':[10,45,18]}
pd.DataFrame(data)

     Name  JNO
0  Sachin   10
1   Rohit   45
2   Virat   18

In [32]:
d={'Name':['Sachin','Rohit','Virat','Kuldeep','Dhoni'],
  'Age':[51,37,36,28,42],
  'Nickname':['Master','Hitman','King','Chinaman','Thala'],
  'City':['Mumbai','Mumbai','Bengluru','Delhi','Chennai']}

df=pd.DataFrame(d)
df

      Name  Age  Nickname      City
0   Sachin   51    Master    Mumbai
1    Rohit   37    Hitman    Mumbai
2    Virat   36      King  Bengluru
3  Kuldeep   28  Chinaman     Delhi
4    Dhoni   42     Thala   Chennai

In [33]:
df[['Name','City']]

      Name      City
0   Sachin    Mumbai
1    Rohit    Mumbai
2    Virat  Bengluru
3  Kuldeep     Delhi
4    Dhoni   Chennai

# 9)Slicing DataFrame using iloc and loc

In [34]:
data={'one':pd.Series([1,2,3,4]),
      'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

Basic loc operation

In [35]:
df.loc[1:2,'two':'three']

   two  three
1   20    200
2   30    300

Basic iloc operation

In [36]:
df.iloc[1:-1,1:1]

Empty DataFrame
Columns: []
Index: [1, 2]

In [37]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

selecting specific rows

In [38]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

slicing using condition

In [39]:
df.loc[df['two'] > 30, ['three','four']]

   three  four
3    400  4000

In [40]:
df.loc[df['three'] < 300, ['one','four']]

   one  four
0    1  1000
1    2  2000

# 10)Column addition in dataframe

In [41]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [43]:
l = [18,45,10,55]
df['five'] = l
df

   one  two  three  four  five
0    1   10    100  1000    18
1    2   20    200  2000    45
2    3   30    300  3000    10
3    4   40    400  4000    55

In [44]:
sr = pd.Series([111,222,333,444])
df['six'] = sr
df

   one  two  three  four  five  six
0    1   10    100  1000    18  111
1    2   20    200  2000    45  222
2    3   30    300  3000    10  333
3    4   40    400  4000    55  444

Using an existing Column

In [45]:
df['seven'] = df['one'] + 5
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    18  111      6
1    2   20    200  2000    45  222      7
2    3   30    300  3000    10  333      8
3    4   40    400  4000    55  444      9

# 11)Column Deletion in Dataframes

In [46]:
del df['seven']
df

   one  two  three  four  five  six
0    1   10    100  1000    18  111
1    2   20    200  2000    45  222
2    3   30    300  3000    10  333
3    4   40    400  4000    55  444

Using pop() function

In [47]:
df.pop('six')
df

   one  two  three  four  five
0    1   10    100  1000    18
1    2   20    200  2000    45
2    3   30    300  3000    10
3    4   40    400  4000    55

# 12)Addition of rows

In [48]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])


df3 = df1.append(df2).reset_index(drop = True)

df3

C:\Users\New\AppData\Local\Temp\ipykernel_15376\3894115464.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2).reset_index(drop = True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

# 13)Pandas drop function

In [49]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

axis=0:Row-wise

In [50]:
df.drop([0,1], axis = 0, inplace = True)
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

axis=1:Row-wise

In [51]:
df.drop(['one','three'], axis = 1, inplace = True)
df

   two  four
2   30  3000
3   40  4000

# 14)Transposing a DataFrame

In [53]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [54]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

# 15)Statistical or Mathematical Functions

In [55]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

1.Sum

In [58]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

2.Mean

In [59]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

3.Median

In [61]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

4.Mode

In [62]:
de = pd.DataFrame({'A': [1, 2, 2, 3, 4, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50, 60]})

print('A' , de['A'].mode())
print('B' , de['B'].mode())

A 0    4
Name: A, dtype: int64
B 0    20
1    40
Name: B, dtype: int64

5.Variance

In [63]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

6.Min

In [64]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

7.Max

In [65]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

8.Standart Deviation

In [66]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

# 16) Describe Function

The describe() method in a Pandas DataFrame returns descriptive statistics of the data in the DataFrame. It provides a quick summary of the central tendency, dispersion, and shape of the distribution of a set of numerical data.

In [68]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

# 17)Pipe Function

The pipe() method in a Pandas DataFrame allows you to apply a function to the DataFrame, similar to the way the apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [70]:
def add_(i,j):
    return i + j

df.pipe(add_, 10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [71]:
def mean_(col):
    return col.mean()

def square(i):
    return i ** 2

df.pipe(mean_).pipe(square)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

# 18)Apply Function

The apply() method in a Pandas DataFrame allows you to apply a function to the DataFrame, either to individual elements or to the entire DataFrame. The function can be either a built-in Python function or a user-defined function.

In [72]:
df.apply(lambda x: x.max() - x.min())

one         3
two        30
three     300
four     3000
dtype: int64

# 19)Apply map Function

The map() method in a Pandas DataFrame allows you to apply a function to each element of a specific column of the DataFrame. The function can be either a built-in Python function or a user-defined function.

In [74]:
df.applymap(lambda x : x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

# 20)Reindex Function

The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [75]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

print(df)
print('-'*30)
print(df.reindex([1,0,3,2]))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
   one  two  three  four
1    2   20    200  2000
0    1   10    100  1000
3    4   40    400  4000
2    3   30    300  3000

# 21)Renaming the columns in pandas DataFrame

The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values

In [76]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

df.rename(columns = {'one' : 'One','two': 'Two', 'three' : 'Three', 'four' : 'Four'}, 
           inplace = True, index = {0:'a',1:'b',2:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

# 22)Sorting in the pandas DataFrame

Pandas provides several methods to sort a DataFrame based on one or more columns.

sort_values: This method sorts the DataFrame based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of False. bash

In [77]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200  2000
2   31   30    500  3000
3   41   40    400  4000

In [78]:
df.sort_values(by = 'one', ascending = False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

In [79]:
df.sort_values(by = ['one','two'])

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

Sort with Specific Sorting Algorithm:<br>

1)quicksort
2)mergesort
3)heapsort

In [81]:
df.sort_values(by = ['one'], kind = 'heapsort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

# 23)GroupBy Function

The groupby function in pandas is used to split a dataframe into groups based on one or more columns. It returns a DataFrameGroupBy object, which is similar to a DataFrame but has some additional methods to perform operations on the grouped data.

In [82]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [83]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [84]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [85]:
df.groupby('Team').sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [86]:
df.groupby('Team').sum()['Points'].sort_values(ascending = False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

In [87]:
groups = df.groupby('Team')

groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])

            sum        mean        std  amax  amin
Team
Australia  1706  853.000000  53.740115   891   815
India      2459  819.666667  49.702448   876   782
NZ         2332  777.333333  97.449132   883   691
SA         3218  804.500000  28.769196   834   776

In [ ]:
df.groupby('Team').filter(lambda x : len(x) == 4)